clear %清理变量
clc %清屏
close all %关闭图像
format short g ;%改变显示格式，不使用默认的科学计数法的格式
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%参数定义部分

N=10;%城市的个数

%CD 是CityDistance缩写，表示城市间距离, 代价矩阵
CD=[
0 1044.6 1502.8 1053.3 1895.7 400.3 461.4 1337.2 402 900.9;
1044.6 0 1665 686.3 1203.8 1102.7 852.6 875.2 412.1 1219;
1502.8 1665 0 981 1234.6  1128.3 1890.1 918.9 1276.9 613;
1053.3 686.3  981 0  881.1 781.7 1210.7 315.2 287.9  646.4;
1895.7 1203.8 1234.6 881.1  0 1649.2 2023.8 579.3 1076.3  1305.3;
400.3 1102.7 1128.3 781.7  1649.2  0 810.8 1076.3 811.4 512.8;
461.4 852.6 1890.1 1210.7 2023.8  810.8 0 1501.3 971.8 1263.9;
1337.2 875.2 918.9  315.2  579.3 1076.3 1501.3  0 566.7 771.8;
402 412.1 1276.9 287.9  1076.3 811.4 971.8 566.7 0 820.8;
900.9  1219  613  646.4 1305.3 512.8 1263.9 771.8 820.8 0 ;   
];
%最优路径：5669.2
%最优路径的代价： 1 6 10 3 5 8 4 9 2 7



M=500;%预设种群规模 
D=100;%迭代次数
DC=D;%迭代计数器
pc=0.8;%交叉概率
pm=0.05;%变异概率



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%初始化种群Farm，采用随机生成方法
Temp2=zeros(M,1);%1列用于存放距离
Temp1=zeros(M,N);%N列用于存放路径
for index=1:M %循环M次
Temp1(index,:)=randperm(N);%生成一个1到N随机序列
end
% 种群规模M为行数  城市的个数N+1为列数 ,最后一列放适应度
Farm=[Temp1,Temp2];%矩阵的合并

while 1    %循环体1  开始标识符
% %debug
% FarmSize=(size(Farm));
% R=FarmSize(1);
% fprintf('\n第%.f次迭代开始，种群的个数%.f\n',D-DC+1,R);
% %debug
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%评价种群，计算每个个体的适应度
Farm=AdaptFun(Farm,CD);%调用适应度函数AdaptFun，生成适应度


if DC==0  %如果迭代次数达到了预设值
    %输出结果 ：最优路径、最优路径的代价
    result=min(Farm(:,N+1));%在所有行的第N+1列中寻找最小值
    fprintf('\n最优路径的代价:\n %.1f',result);
    
    fprintf('\n\n\n最优路径:\n');
   [r,c]=find(Farm(:,N+1)==result);%寻找存放最小值的对应行号
   for index=1:N  %打印路径
   fprintf('%.0f  ',Farm(r(1),index));
   %r可能出现多行情况（有多个解），故r(1)
          
   end
   fprintf('\n');

   
 
    break;%那么跳出循环体1
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%选择
Farm=Selection(Farm,M);
% %debug
% FarmSize=(size(Farm));
% R=FarmSize(1);
% fprintf('\n选择操作结束，种群的个数%.f\n',R);
% 
% 
%     result=min(Farm(:,N+1));%在所有行的第N+1列中寻找最小值
%     fprintf('\n最优路径的代价:\n %.1f',result);
% %debug

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%交叉
Farm=Crossover(Farm,pc);
% %debug
% FarmSize=(size(Farm));
% R=FarmSize(1);
% fprintf('\n交叉操作结束，种群的个数%.f\n',R);
% %debug

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%变异
Farm=Mutation(Farm,pm);
% %debug
% FarmSize=(size(Farm));
% R=FarmSize(1);
% fprintf('\n第%.f次迭代结束，种群的个数%.f\n',D-DC+1,R);
% %debug

DC=DC-1; %迭代计数器
%重新跳转到“评价种群”这一步
end    %循环体1  结束标识符

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%msgbox('运行结束','YYM');

